SELECT * FROM Product;

-- shop=# SELECT * FROM Product;
--  product_id | product_name | product_type | sale_price | purchase_price | regist_date
-- ------------+--------------+--------------+------------+----------------+-------------
--  0001       | T恤衫        | 衣服         |       1000 |            500 | 2009-09-20
--  0002       | 打孔器       | 办公用品     |        500 |            320 | 2009-09-11
--  0003       | 运动T恤      | 衣服         |       4000 |           2800 |
--  0004       | 菜刀         | 厨房用具     |       3000 |           2800 | 2009-09-20
--  0005       | 高压锅       | 厨房用具     |       6800 |           5000 | 2009-01-15
--  0006       | 叉子         | 厨房用具     |        500 |                | 2009-09-20
--  0007       | 擦彩板       | 厨房用具     |        880 |            790 | 2008-04-28
--  0008       | 圆珠笔       | 办公用品     |         10 |                | 2009-11-11
-- (8 rows)